In [1]:
%reload_ext sql

In [2]:
%%sql mysql+pymysql://root:MyN3wP4ssw0rd@localhost:3306/Foodie_fie

SELECT 1+1;

1 rows affected.

[(2,)]

# Foodie Fie

A: Based off the 8 sample customers provided in the sample from the subscriptions table, write a brief description about each customerâ€™s onboarding journey

In [3]:
%%sql

SELECT *
FROM   subscription
       INNER JOIN plans using(plan_id)
WHERE  customer_id IN ( 1, 2, 3, 4,
                        5, 6, 7, 8 )
ORDER  BY customer_id

 * mysql+pymysql://root:***@localhost:3306/Foodie_fie
20 rows affected.

[(0, 1, datetime.date(2020, 8, 1), 'trial', Decimal('0.00')),
 (1, 1, datetime.date(2020, 8, 8), 'basic monthly', Decimal('9.90')),
 (0, 2, datetime.date(2020, 9, 20), 'trial', Decimal('0.00')),
 (3, 2, datetime.date(2020, 9, 27), 'pro annual', Decimal('199.00')),
 (0, 3, datetime.date(2020, 1, 13), 'trial', Decimal('0.00')),
 (1, 3, datetime.date(2020, 1, 20), 'basic monthly', Decimal('9.90')),
 (0, 4, datetime.date(2020, 1, 17), 'trial', Decimal('0.00')),
 (1, 4, datetime.date(2020, 1, 24), 'basic monthly', Decimal('9.90')),
 (4, 4, datetime.date(2020, 4, 21), 'churn', None),
 (0, 5, datetime.date(2020, 8, 3), 'trial', Decimal('0.00')),
 (1, 5, datetime.date(2020, 8, 10), 'basic monthly', Decimal('9.90')),
 (0, 6, datetime.date(2020, 12, 23), 'trial', Decimal('0.00')),
 (1, 6, datetime.date(2020, 12, 30), 'basic monthly', Decimal('9.90')),
 (4, 6, datetime.date(2021, 2, 26), 'churn', None),
 (0, 7, datetime.date(2020, 2, 5), 'trial', Decimal('0.00')),
 (1, 7, datetime.date(2020, 2, 12), 'basic monthly', Decimal('9.90')),
 (2, 7, datetime.date(2020, 5, 22), 'pro monthly', Decimal('19.90')),
 (0, 8, datetime.date(2020, 6, 11), 'trial', Decimal('0.00')),
 (1, 8, datetime.date(2020, 6, 18), 'basic monthly', Decimal('9.90')),
 (2, 8, datetime.date(2020, 8, 3), 'pro monthly', Decimal('19.90'))]

B-1:How many customers has Foodie-Fi ever had?

In [4]:
%%sql

SELECT Count(DISTINCT( customer_id )) Total_customer
FROM   subscription

 * mysql+pymysql://root:***@localhost:3306/Foodie_fie
1 rows affected.

[(1000,)]

B-2:What is the monthly distribution of trial plan start_date values for our dataset - use the start of the month as the group by value

In [5]:
%%sql

SELECT Month(start_date)     AS Month,
       Monthname(start_date) month_name,
       Count(*)              no_of_trail
FROM   subscription
WHERE  plan_id = 0
GROUP  BY month,
          month_name
ORDER  BY 1

 * mysql+pymysql://root:***@localhost:3306/Foodie_fie
12 rows affected.

[(1, 'January', 88),
 (2, 'February', 68),
 (3, 'March', 94),
 (4, 'April', 81),
 (5, 'May', 88),
 (6, 'June', 79),
 (7, 'July', 89),
 (8, 'August', 88),
 (9, 'September', 87),
 (10, 'October', 79),
 (11, 'November', 75),
 (12, 'December', 84)]

B-3: What plan start_date values occur after the year 2020 for our dataset? Show the breakdown by count of events for each plan_name

In [10]:
%%sql

SELECT plan_id,
       plan_name,
       Count(customer_id)
FROM   subscription
       INNER JOIN plans using(plan_id)
WHERE  Year(start_date) > 2020
GROUP  BY plan_id,
          plan_name
ORDER  BY plan_id

 * mysql+pymysql://root:***@localhost:3306/Foodie_fie
4 rows affected.

[(1, 'basic monthly', 8),
 (2, 'pro monthly', 60),
 (3, 'pro annual', 63),
 (4, 'churn', 71)]

B-4: What is the customer count and percentage of customers who have churned rounded to 1 decimal place?

In [12]:
%%sql

WITH sub
     AS (SELECT Count(*) AS rn
         FROM   subscription
         WHERE  plan_id = 4)
SELECT sub.rn                                            AS Customer_Churn,
       Count(DISTINCT( customer_id ))                    AS total_customer,
       ( sub.rn ) * 100 / Count(DISTINCT( customer_id )) AS Percentage
FROM   subscription,
       sub
GROUP  BY 1

 * mysql+pymysql://root:***@localhost:3306/Foodie_fie
1 rows affected.

[(307, 1000, Decimal('30.7000'))]

B-5:How many customers have churned straight after their initial free trial - what percentage is this rounded to the nearest whole number?

In [15]:
%%sql

WITH sub
     AS (SELECT *,
                Row_number()
                  OVER(
                    partition BY customer_id
                    ORDER BY start_date ) rn
         FROM   subscription
         ORDER  BY customer_id),
     sub_2
     AS (SELECT Count(*) rv
         FROM   sub
         WHERE  plan_id = 4
                AND rn = 2)
SELECT sub_2.rv
       churned_customer,
       Round(sub_2.rv / Count(DISTINCT( customer_id )) * 100, 2) percentage
FROM   sub_2,
       sub
GROUP  BY sub_2.rv

 * mysql+pymysql://root:***@localhost:3306/Foodie_fie
1 rows affected.

[(92, Decimal('9.20'))]

B-6:What is the number and percentage of customer plans after their initial free trial?

In [19]:
%%sql

WITH sub
     AS (SELECT *,
                Row_number()
                  OVER(
                    partition BY customer_id
                    ORDER BY start_date ) rn
         FROM   subscription
                LEFT JOIN plans using(plan_id))
SELECT plan_id,
       plan_name,
       Count(plan_id)                                         customer_number,
       Round(Count(plan_id) / (SELECT Count(DISTINCT( customer_id ))
                               FROM   subscription) * 100, 1) percentage
FROM   sub
WHERE  rn = 2
GROUP  BY plan_id,
          plan_name
ORDER  BY plan_id

 * mysql+pymysql://root:***@localhost:3306/Foodie_fie
4 rows affected.

[(1, 'basic monthly', 546, Decimal('54.6')),
 (2, 'pro monthly', 325, Decimal('32.5')),
 (3, 'pro annual', 37, Decimal('3.7')),
 (4, 'churn', 92, Decimal('9.2'))]

B-7: What is the customer count and percentage breakdown of all 5 plan_name values at 2020-12-31?

In [21]:
%%sql

WITH sub
     AS (SELECT *,
                Row_number()
                  OVER(
                    partition BY customer_id
                    ORDER BY start_date DESC ) AS rn
         FROM   subscription
                LEFT JOIN plans using(plan_id)
         WHERE  start_date <= '2020-12-31')
SELECT plan_name,
       Count(*)                                         AS customer_count,
       Round(Count(*) * 100 / (SELECT Count(DISTINCT( customer_id ))
                               FROM   subscription), 1) AS percentage
FROM   sub
WHERE  rn = 1
GROUP  BY 1

 * mysql+pymysql://root:***@localhost:3306/Foodie_fie
5 rows affected.

[('basic monthly', 224, Decimal('22.4')),
 ('pro annual', 195, Decimal('19.5')),
 ('churn', 236, Decimal('23.6')),
 ('pro monthly', 326, Decimal('32.6')),
 ('trial', 19, Decimal('1.9'))]

 B-8: How many customers have upgraded to an annual plan in 2020?

In [22]:
%%sql

WITH sub
     AS (SELECT *,
                Row_number()
                  OVER(
                    partition BY customer_id
                    ORDER BY start_date DESC ) AS rn
         FROM   subscription
                LEFT JOIN plans using (plan_id)
         WHERE  Year(start_date) = 2020)
SELECT Count(*) AS Total_customer_with_plan_proannual
FROM   sub
WHERE  plan_name = "pro annual"

 * mysql+pymysql://root:***@localhost:3306/Foodie_fie
1 rows affected.

[(195,)]

B-9: How many days on average does it take for a customer to an annual plan from the day they join Foodie-Fi?

In [23]:
%%sql

WITH sub
     AS (SELECT *,
                Lag(start_date, 1)
                  OVER(
                    partition BY customer_id) AS free_trial_date
         FROM   subscription
         WHERE  plan_id IN ( 0, 3 ))
SELECT Round(Avg(Datediff(start_date, free_trial_date)), 1) AS avg_days
FROM   sub
WHERE  free_trial_date IS NOT NULL

 * mysql+pymysql://root:***@localhost:3306/Foodie_fie
1 rows affected.

[(Decimal('104.6'),)]

B-10: Can you further breakdown this average value into 30 day periods (i.e. 0-30 days, 31-60 days etc)

In [25]:
%%sql

WITH sub
     AS (SELECT *,
                Lag(start_date, 1, 0)
                  OVER(
                    partition BY customer_id) date
         FROM   subscription
         WHERE  plan_id IN( 0, 3 ))
SELECT Ceiling(Datediff(start_date, date) / 30)        breakdown,
       Count(Ceiling(Datediff(start_date, date) / 30)) customers
FROM   sub
WHERE  date != 0
GROUP  BY Ceiling(Datediff(start_date, date) / 30)
ORDER  BY Ceiling(Datediff(start_date, date) / 30)

 * mysql+pymysql://root:***@localhost:3306/Foodie_fie
12 rows affected.

[(1, 49),
 (2, 24),
 (3, 34),
 (4, 35),
 (5, 42),
 (6, 36),
 (7, 26),
 (8, 4),
 (9, 5),
 (10, 1),
 (11, 1),
 (12, 1)]

## B-11: How many customers downgraded from a pro monthly to a basic monthly plan in 2020?

In [28]:
%%sql

WITH sub
     AS (SELECT *,
                Lead(plan_id, 1)
                  OVER(
                    partition BY customer_id
                    ORDER BY start_date ) Next_Plan
         FROM   subscription)
SELECT Count(*) AS downgraded_customers
FROM   sub
WHERE  plan_id = 1
       AND next_plan = 0

 * mysql+pymysql://root:***@localhost:3306/Foodie_fie
1 rows affected.

[(0,)]

C :-The Foodie-Fi team wants you to create a new payments table for the year 2020 that includes amounts paid by each customer in the subscriptions table with the following requirements:

- monthly payments always occur on the same day of month as the original start_date of any monthly paid plan
- upgrades from basic to monthly or pro plans are reduced by the current paid amount in that month and start immediately
- upgrades from pro monthly to pro annual are paid at the end of the current billing period and also starts at the end of the month period
- once a customer churns they will no longer make payments

Ans- Part A: in this we select the those whose plan_name is not equal to churn and trial and year=2020 and giving last date where plan changes.

In [31]:
%%sql

SELECT customer_id,
       plan_name,
       Lag(plan_name, 1)
         OVER(
           partition BY customer_id
           ORDER BY start_date ) AS previous_plan_name,
       price,
       Lag(price, 1)
         OVER(
           partition BY customer_id
           ORDER BY start_date ) AS previous_price,
       start_date,
       Lag(start_date, 1)
         OVER(
           partition BY customer_id
           ORDER BY start_date ) next_plan_date
FROM   subscription
       INNER JOIN plans using (plan_id)
WHERE  Year(start_date) = 2020
       AND customer_id = 8
       AND plan_name NOT IN ( "trial", "churn" )

 * mysql+pymysql://root:***@localhost:3306/Foodie_fie
2 rows affected.

[(8, 'basic monthly', None, Decimal('9.90'), None, datetime.date(2020, 6, 18), None),
 (8, 'pro monthly', 'basic monthly', Decimal('19.90'), Decimal('9.90'), datetime.date(2020, 8, 3), datetime.date(2020, 6, 18))]

Part B: those who don,t have the last date we will give last date as 2020-12-31 as asked in the question taking year 2020

In [3]:
%%sql

WITH sub
     AS (SELECT *,
                Lead(start_date, 1)
                  OVER(
                    partition BY customer_id
                    ORDER BY start_date ) next_plan
         FROM   subscription
                INNER JOIN plans using (plan_id)
         WHERE  plan_name NOT IN ( 'trial', 'churn' )
                AND Year(start_date) = 2020),
     sub_2
     AS (SELECT customer_id,
                plan_id,
                plan_name,
                start_date,
                COALESCE(next_plan, "2020-12-31") last_date,
                price
         FROM   sub)
SELECT *
FROM   sub_2 limit 5;

 * mysql+pymysql://root:***@localhost:3306/Foodie_fie
5 rows affected.

[(1, 1, 'basic monthly', datetime.date(2020, 8, 8), '2020-12-31', Decimal('9.90')),
 (2, 3, 'pro annual', datetime.date(2020, 9, 27), '2020-12-31', Decimal('199.00')),
 (3, 1, 'basic monthly', datetime.date(2020, 1, 20), '2020-12-31', Decimal('9.90')),
 (4, 1, 'basic monthly', datetime.date(2020, 1, 24), '2020-12-31', Decimal('9.90')),
 (5, 1, 'basic monthly', datetime.date(2020, 8, 10), '2020-12-31', Decimal('9.90'))]

Part C: Then to find the consecutive date monthwise in mysql we use with + recursive  

Use code for consecutive date: date_add(Column name, Interval 1 month) we can use it by putting "day" and "year" also

In [4]:
%%sql

WITH recursive cte AS
(
           SELECT     *,
                      lead(start_date, 1) OVER ( partition BY customer_id ORDER BY start_date ) AS next_plan
           FROM       subscription
           INNER JOIN plans
           using      (plan_id)
           WHERE      plan_name NOT IN ('trial',
                                        'churn')
           AND        year(start_date) = 2020 ), cte2 AS
(
       SELECT customer_id,
              plan_id,
              plan_name,
              start_date,
              COALESCE(next_plan, "2020-12-31") AS last_date,
              price
       FROM   cte ), cte3 AS
(
       SELECT customer_id,
              plan_id,
              plan_name,
              start_date,
              last_date,
              price
       FROM   cte2
       UNION ALL
       SELECT customer_id,
              plan_id,
              plan_name,
              date_add(start_date, interval 1 month) AS start_date,
              last_date,
              price
       FROM   cte3
       WHERE  last_date > date_add(start_date, interval 1 month)
       AND    plan_name <> 'pro annual' )
SELECT   *
FROM     cte3
ORDER BY customer_id,
         start_date limit 5;

 * mysql+pymysql://root:***@localhost:3306/Foodie_fie
5 rows affected.

[(1, 1, 'basic monthly', datetime.date(2020, 8, 8), '2020-12-31', Decimal('9.90')),
 (1, 1, 'basic monthly', datetime.date(2020, 9, 8), '2020-12-31', Decimal('9.90')),
 (1, 1, 'basic monthly', datetime.date(2020, 10, 8), '2020-12-31', Decimal('9.90')),
 (1, 1, 'basic monthly', datetime.date(2020, 11, 8), '2020-12-31', Decimal('9.90')),
 (1, 1, 'basic monthly', datetime.date(2020, 12, 8), '2020-12-31', Decimal('9.90'))]